driver-tests/bpelse/TerminationHandler/TerminationHandlerJbi/src/jbiServiceUnits/TerminationHandlerBpel/TH_TerminatingEH_NestedFlow/IOWSDL9.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="IOWSDL9" targetNamespace="http://j2ee.netbeans.org/wsdl/IOWSDL9"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://j2ee.netbeans.org/wsdl/IOWSDL9">
    <types/>
    <message name="IOWSDL9OperationRequest">
        <part name="InputPart" type="xsd:string"/>
    </message>
    <message name="IOWSDL9OperationReply">
        <part name="OutputPart" type="xsd:string"/>
    </message>
    <portType name="IOWSDL9PortType">
        <wsdl:operation name="IOWSDL9Operation">
            <wsdl:input name="input1" message="tns:IOWSDL9OperationRequest"/>
            <wsdl:output name="output1" message="tns:IOWSDL9OperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="IOWSDL9Binding" type="tns:IOWSDL9PortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="IOWSDL9Operation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/IOWSDL9"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/IOWSDL9"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="IOWSDL9Service">
        <wsdl:port name="IOWSDL9Port" binding="tns:IOWSDL9Binding">
            <soap:address location="http://localhost:${HttpDefaultPort}/TerminationHandlerBpel/TH_TerminatingEH_NestedFlow/IOWSDL9Service/IOWSDL9Port"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="IOWSDL9Plink">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="IOWSDL9PortTypeRole" portType="tns:IOWSDL9PortType"/>
    </plnk:partnerLinkType>
</definitions>
